balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16CR926.PIC
        <edc:SFRDef edc:access="nn-nnnnn" edc:cname="LCDCON" edc:desc="" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-00000" edc:name="LCDCON" edc:nzwidth="0x8" edc:por="00-00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LMUX" edc:desc="" edc:mask="0x3" edc:name="LMUX" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x3" edc:name="CS" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="VGEN" edc:desc="" edc:mask="0x1" edc:name="VGEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SLPEN" edc:desc="" edc:mask="0x1" edc:name="SLPEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LCDEN" edc:desc="" edc:mask="0x1" edc:name="LCDEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LMUX0" edc:desc="" edc:mask="0x1" edc:name="LMUX0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LMUX1" edc:desc="" edc:mask="0x1" edc:name="LMUX1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS0" edc:desc="" edc:mask="0x1" edc:name="CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:desc="" edc:mask="0x1" edc:name="CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BIAS" edc:desc="" edc:mask="0x1" edc:name="BIAS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WERR" edc:desc="" edc:mask="0x1" edc:name="WERR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDD00" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDD00" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG00" edc:desc="" edc:mask="0x1" edc:name="SEG00" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG01" edc:desc="" edc:mask="0x1" edc:name="SEG01" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG02" edc:desc="" edc:mask="0x1" edc:name="SEG02" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG03" edc:desc="" edc:mask="0x1" edc:name="SEG03" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG04" edc:desc="" edc:mask="0x1" edc:name="SEG04" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG05" edc:desc="" edc:mask="0x1" edc:name="SEG05" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG06" edc:desc="" edc:mask="0x1" edc:name="SEG06" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG07" edc:desc="" edc:mask="0x1" edc:name="SEG07" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDD01" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDD01" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG08" edc:desc="" edc:mask="0x1" edc:name="SEG08" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG09" edc:desc="" edc:mask="0x1" edc:name="SEG09" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG10" edc:desc="" edc:mask="0x1" edc:name="SEG10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG11" edc:desc="" edc:mask="0x1" edc:name="SEG11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG12" edc:desc="" edc:mask="0x1" edc:name="SEG12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG13" edc:desc="" edc:mask="0x1" edc:name="SEG13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG14" edc:desc="" edc:mask="0x1" edc:name="SEG14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG15" edc:desc="" edc:mask="0x1" edc:name="SEG15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDD02" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDD02" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG16" edc:desc="" edc:mask="0x1" edc:name="SEG16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG17" edc:desc="" edc:mask="0x1" edc:name="SEG17" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG18" edc:desc="" edc:mask="0x1" edc:name="SEG18" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG19" edc:desc="" edc:mask="0x1" edc:name="SEG19" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG20" edc:desc="" edc:mask="0x1" edc:name="SEG20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG21" edc:desc="" edc:mask="0x1" edc:name="SEG21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG22" edc:desc="" edc:mask="0x1" edc:name="SEG22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG23" edc:desc="" edc:mask="0x1" edc:name="SEG23" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDD03" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDD03" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG24" edc:desc="" edc:mask="0x1" edc:name="SEG24" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG25" edc:desc="" edc:mask="0x1" edc:name="SEG25" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG26" edc:desc="" edc:mask="0x1" edc:name="SEG26" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG27" edc:desc="" edc:mask="0x1" edc:name="SEG27" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG28" edc:desc="" edc:mask="0x1" edc:name="SEG28" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG29" edc:desc="" edc:mask="0x1" edc:name="SEG29" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG30" edc:desc="" edc:mask="0x1" edc:name="SEG30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG31" edc:desc="" edc:mask="0x1" edc:name="SEG31" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDD04" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDD04" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG00" edc:desc="" edc:mask="0x1" edc:name="SEG00" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG01" edc:desc="" edc:mask="0x1" edc:name="SEG01" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG02" edc:desc="" edc:mask="0x1" edc:name="SEG02" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG03" edc:desc="" edc:mask="0x1" edc:name="SEG03" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG04" edc:desc="" edc:mask="0x1" edc:name="SEG04" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG05" edc:desc="" edc:mask="0x1" edc:name="SEG05" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG06" edc:desc="" edc:mask="0x1" edc:name="SEG06" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG07" edc:desc="" edc:mask="0x1" edc:name="SEG07" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDD05" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDD05" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG08" edc:desc="" edc:mask="0x1" edc:name="SEG08" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG09" edc:desc="" edc:mask="0x1" edc:name="SEG09" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG10" edc:desc="" edc:mask="0x1" edc:name="SEG10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG11" edc:desc="" edc:mask="0x1" edc:name="SEG11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG12" edc:desc="" edc:mask="0x1" edc:name="SEG12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG13" edc:desc="" edc:mask="0x1" edc:name="SEG13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG14" edc:desc="" edc:mask="0x1" edc:name="SEG14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG15" edc:desc="" edc:mask="0x1" edc:name="SEG15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDD06" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDD06" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG16" edc:desc="" edc:mask="0x1" edc:name="SEG16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG17" edc:desc="" edc:mask="0x1" edc:name="SEG17" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG18" edc:desc="" edc:mask="0x1" edc:name="SEG18" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG19" edc:desc="" edc:mask="0x1" edc:name="SEG19" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG20" edc:desc="" edc:mask="0x1" edc:name="SEG20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG21" edc:desc="" edc:mask="0x1" edc:name="SEG21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG22" edc:desc="" edc:mask="0x1" edc:name="SEG22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG23" edc:desc="" edc:mask="0x1" edc:name="SEG23" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDD07" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDD07" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG24" edc:desc="" edc:mask="0x1" edc:name="SEG24" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG25" edc:desc="" edc:mask="0x1" edc:name="SEG25" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG26" edc:desc="" edc:mask="0x1" edc:name="SEG26" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG27" edc:desc="" edc:mask="0x1" edc:name="SEG27" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG28" edc:desc="" edc:mask="0x1" edc:name="SEG28" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG29" edc:desc="" edc:mask="0x1" edc:name="SEG29" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG30" edc:desc="" edc:mask="0x1" edc:name="SEG30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG31" edc:desc="" edc:mask="0x1" edc:name="SEG31" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
