balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16CR926.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDD08" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDD08" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG00" edc:desc="" edc:mask="0x1" edc:name="SEG00" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG01" edc:desc="" edc:mask="0x1" edc:name="SEG01" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG02" edc:desc="" edc:mask="0x1" edc:name="SEG02" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG03" edc:desc="" edc:mask="0x1" edc:name="SEG03" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG04" edc:desc="" edc:mask="0x1" edc:name="SEG04" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG05" edc:desc="" edc:mask="0x1" edc:name="SEG05" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG06" edc:desc="" edc:mask="0x1" edc:name="SEG06" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG07" edc:desc="" edc:mask="0x1" edc:name="SEG07" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDD09" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDD09" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG08" edc:desc="" edc:mask="0x1" edc:name="SEG08" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG09" edc:desc="" edc:mask="0x1" edc:name="SEG09" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG10" edc:desc="" edc:mask="0x1" edc:name="SEG10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG11" edc:desc="" edc:mask="0x1" edc:name="SEG11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG12" edc:desc="" edc:mask="0x1" edc:name="SEG12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG13" edc:desc="" edc:mask="0x1" edc:name="SEG13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG14" edc:desc="" edc:mask="0x1" edc:name="SEG14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG15" edc:desc="" edc:mask="0x1" edc:name="SEG15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDD10" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDD10" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG16" edc:desc="" edc:mask="0x1" edc:name="SEG16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG17" edc:desc="" edc:mask="0x1" edc:name="SEG17" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG18" edc:desc="" edc:mask="0x1" edc:name="SEG18" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG19" edc:desc="" edc:mask="0x1" edc:name="SEG19" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG20" edc:desc="" edc:mask="0x1" edc:name="SEG20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG21" edc:desc="" edc:mask="0x1" edc:name="SEG21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG22" edc:desc="" edc:mask="0x1" edc:name="SEG22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG23" edc:desc="" edc:mask="0x1" edc:name="SEG23" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDD11" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDD11" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG24" edc:desc="" edc:mask="0x1" edc:name="SEG24" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG25" edc:desc="" edc:mask="0x1" edc:name="SEG25" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG26" edc:desc="" edc:mask="0x1" edc:name="SEG26" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG27" edc:desc="" edc:mask="0x1" edc:name="SEG27" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG28" edc:desc="" edc:mask="0x1" edc:name="SEG28" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG29" edc:desc="" edc:mask="0x1" edc:name="SEG29" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG30" edc:desc="" edc:mask="0x1" edc:name="SEG30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG31" edc:desc="" edc:mask="0x1" edc:name="SEG31" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDD12" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDD12" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG00" edc:desc="" edc:mask="0x1" edc:name="SEG00" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG01" edc:desc="" edc:mask="0x1" edc:name="SEG01" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG02" edc:desc="" edc:mask="0x1" edc:name="SEG02" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG03" edc:desc="" edc:mask="0x1" edc:name="SEG03" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG04" edc:desc="" edc:mask="0x1" edc:name="SEG04" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG05" edc:desc="" edc:mask="0x1" edc:name="SEG05" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG06" edc:desc="" edc:mask="0x1" edc:name="SEG06" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG07" edc:desc="" edc:mask="0x1" edc:name="SEG07" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDD13" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDD13" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG08" edc:desc="" edc:mask="0x1" edc:name="SEG08" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG09" edc:desc="" edc:mask="0x1" edc:name="SEG09" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG10" edc:desc="" edc:mask="0x1" edc:name="SEG10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG11" edc:desc="" edc:mask="0x1" edc:name="SEG11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG12" edc:desc="" edc:mask="0x1" edc:name="SEG12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG13" edc:desc="" edc:mask="0x1" edc:name="SEG13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG14" edc:desc="" edc:mask="0x1" edc:name="SEG14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG15" edc:desc="" edc:mask="0x1" edc:name="SEG15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDD14" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDD14" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG16" edc:desc="" edc:mask="0x1" edc:name="SEG16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG17" edc:desc="" edc:mask="0x1" edc:name="SEG17" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG18" edc:desc="" edc:mask="0x1" edc:name="SEG18" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG19" edc:desc="" edc:mask="0x1" edc:name="SEG19" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG20" edc:desc="" edc:mask="0x1" edc:name="SEG20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG21" edc:desc="" edc:mask="0x1" edc:name="SEG21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG22" edc:desc="" edc:mask="0x1" edc:name="SEG22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG23" edc:desc="" edc:mask="0x1" edc:name="SEG23" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDD15" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDD15" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG24" edc:desc="" edc:mask="0x1" edc:name="SEG24" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG25" edc:desc="" edc:mask="0x1" edc:name="SEG25" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG26" edc:desc="" edc:mask="0x1" edc:name="SEG26" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG27" edc:desc="" edc:mask="0x1" edc:name="SEG27" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG28" edc:desc="" edc:mask="0x1" edc:name="SEG28" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG29" edc:desc="" edc:mask="0x1" edc:name="SEG29" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG30" edc:desc="" edc:mask="0x1" edc:name="SEG30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG31" edc:desc="" edc:mask="0x1" edc:name="SEG31" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="3" edc:beginaddr="0x180" edc:endaddr="0x1a0" edc:regionid="sfr3">
        <edc:Mirror edc:nzsize="0x1" edc:regionidref="sfr0"/>
        <edc:Mirror edc:nzsize="0x1" edc:regionidref="sfr1"/>
        <edc:Mirror edc:nzsize="0x3" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:Mirror edc:nzsize="0x1" edc:regionidref="sfr1"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TRISF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="TRISF" edc:nzwidth="0x8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISF0" edc:desc="" edc:mask="0x1" edc:name="TRISF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISF1" edc:desc="" edc:mask="0x1" edc:name="TRISF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISF2" edc:desc="" edc:mask="0x1" edc:name="TRISF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISF3" edc:desc="" edc:mask="0x1" edc:name="TRISF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISF4" edc:desc="" edc:mask="0x1" edc:name="TRISF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISF5" edc:desc="" edc:mask="0x1" edc:name="TRISF5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISF6" edc:desc="" edc:mask="0x1" edc:name="TRISF6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISF7" edc:desc="" edc:mask="0x1" edc:name="TRISF7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISF" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TRISF" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
